import 'package:flutter/material.dart';
import 'package:get/get.dart';

class Mylocale implements Translations{
  @override
  Map<String, Map<String, String>> get keys => {
    "ar":{
      "1":"الصفحة الرييسية",
      "2":"اسم المستخدم",
      "3":"كلمة المرور",
      "4":"تسجيل الدخول",
      "5":"مرحبا بعودتك",
      "6":"عرض جميع الاطفال",
      "7":"البروفايل",
      "8":"التطعيمات",
      "9":"الرئيسية",
      "10":"التطعيمات المكتملة",
      "11":"التطعيمات القادمة",
      "12":"الكل",
      "13":"مكتمل",
      "14":"قيد الانتظار",
      "15":"الاسم",
      "16":"الرقم",
      "17":"الايميل",
      "18":"الموقع",
      "19":"تعديل البروفايل",
      "20":"مرحبا بعودتك",
      "21":"الرجوع",
      "22":"ابدأ",
      "23":"الاشعارات",
      "24":"دليل التطعيمات الموصى بها",
      "25":"تمت تصدير بطاقة التطعيم للطفل بنجاح!",
      "26":"االعودة الى الرييسية",
      "27":"حفظ التعديلات",
      "28":'إلغاء',
      "29": "أهمية التطعيمات",
      "30":"التطعيمات تحمي طفلك من الامراض \n الخطيرة وتساعد في بناء مناعتة.استثمر في \n صحة طفلك اليوم!",
      "31":"مستقبل صحي",
      "32":"تطعيمات الاطفال: خطوتك الأولى نحو \n  حماية مستقبل صحي لطفلك بسهولة.",
      "33":"مواعيد التطعيمات",
      "34":"حافظ على صحة طفلك:اكتشف \n مواعيد التطعيمات اللازمة لكل مرحلة\n من مراحل نموه.",
      "35":"تخطي",
      "36":"من ولادة الى شهرين",
      "37":"الرجاء ادخال كلمة المرور",
      "38":"الرجاء أدخال اسم مستخدم",
      "39":"طول الحقل اقل من ثلاثة احرف",
      "40":"تعديل",
      "41":"",
      "42":"",


      },
      
  };
}